RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6200/ip/hpm_sdm_regs.h
/*
 * DFIFO_S_T (RW)
 *
 * 1: the output of SDFIFO is data and timestamp interleaved. First is data.
 * 0: the output of SDFIFO is data only
 */
#define SDM_CH_SDCTRLE_DFIFO_S_T_MASK (0x200000UL)
#define SDM_CH_SDCTRLE_DFIFO_S_T_SHIFT (21U)
#define SDM_CH_SDCTRLE_DFIFO_S_T_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_DFIFO_S_T_SHIFT) & SDM_CH_SDCTRLE_DFIFO_S_T_MASK)
#define SDM_CH_SDCTRLE_DFIFO_S_T_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_DFIFO_S_T_MASK) >> SDM_CH_SDCTRLE_DFIFO_S_T_SHIFT)

/*
 * DATA_S_T (RW)
 *
 * "1: the read output of SData is data and timestamp interleaved. First is data.
 * 0: the read output of SData is data only"
 */
#define SDM_CH_SDCTRLE_DATA_S_T_MASK (0x100000UL)
#define SDM_CH_SDCTRLE_DATA_S_T_SHIFT (20U)
#define SDM_CH_SDCTRLE_DATA_S_T_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_DATA_S_T_SHIFT) & SDM_CH_SDCTRLE_DATA_S_T_MASK)
#define SDM_CH_SDCTRLE_DATA_S_T_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_DATA_S_T_MASK) >> SDM_CH_SDCTRLE_DATA_S_T_SHIFT)

/*
 * SGD_ORDR (RW)
 *
 * CIC order
 * 0: SYNC1
 * 1: SYNC2
 * 2: SYNC3
 * 3: FAST_SYNC
 */
#define SDM_CH_SDCTRLE_SGD_ORDR_MASK (0x60000UL)
#define SDM_CH_SDCTRLE_SGD_ORDR_SHIFT (17U)
#define SDM_CH_SDCTRLE_SGD_ORDR_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_SGD_ORDR_SHIFT) & SDM_CH_SDCTRLE_SGD_ORDR_MASK)
#define SDM_CH_SDCTRLE_SGD_ORDR_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_SGD_ORDR_MASK) >> SDM_CH_SDCTRLE_SGD_ORDR_SHIFT)

/*
 * PWMSYNC (RW)
 *
 * Asserted to double sync the PWM trigger signal
 */
#define SDM_CH_SDCTRLE_PWMSYNC_MASK (0x10000UL)
#define SDM_CH_SDCTRLE_PWMSYNC_SHIFT (16U)
#define SDM_CH_SDCTRLE_PWMSYNC_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_PWMSYNC_SHIFT) & SDM_CH_SDCTRLE_PWMSYNC_MASK)
#define SDM_CH_SDCTRLE_PWMSYNC_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_PWMSYNC_MASK) >> SDM_CH_SDCTRLE_PWMSYNC_SHIFT)

/*
 * CIC_SCL (RW)
 *
 * CIC shift control
 */
#define SDM_CH_SDCTRLE_CIC_SCL_MASK (0x7800U)
#define SDM_CH_SDCTRLE_CIC_SCL_SHIFT (11U)
#define SDM_CH_SDCTRLE_CIC_SCL_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_CIC_SCL_SHIFT) & SDM_CH_SDCTRLE_CIC_SCL_MASK)
#define SDM_CH_SDCTRLE_CIC_SCL_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_CIC_SCL_MASK) >> SDM_CH_SDCTRLE_CIC_SCL_SHIFT)

/*
 * CIC_DEC_RATIO (RW)
 *
 * CIC decimation ratio. 0 means div-by-256
 */
#define SDM_CH_SDCTRLE_CIC_DEC_RATIO_MASK (0x7F8U)
#define SDM_CH_SDCTRLE_CIC_DEC_RATIO_SHIFT (3U)
#define SDM_CH_SDCTRLE_CIC_DEC_RATIO_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_CIC_DEC_RATIO_SHIFT) & SDM_CH_SDCTRLE_CIC_DEC_RATIO_MASK)
#define SDM_CH_SDCTRLE_CIC_DEC_RATIO_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_CIC_DEC_RATIO_MASK) >> SDM_CH_SDCTRLE_CIC_DEC_RATIO_SHIFT)

/*
 * IGN_INI_SAMPLES (RW)
 *
 * NotZero: Don't store the first samples that are not accurate
 * Zero: Store all samples
 */
#define SDM_CH_SDCTRLE_IGN_INI_SAMPLES_MASK (0x7U)
#define SDM_CH_SDCTRLE_IGN_INI_SAMPLES_SHIFT (0U)
#define SDM_CH_SDCTRLE_IGN_INI_SAMPLES_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLE_IGN_INI_SAMPLES_SHIFT) & SDM_CH_SDCTRLE_IGN_INI_SAMPLES_MASK)
#define SDM_CH_SDCTRLE_IGN_INI_SAMPLES_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLE_IGN_INI_SAMPLES_MASK) >> SDM_CH_SDCTRLE_IGN_INI_SAMPLES_SHIFT)

/* Bitfield definition for register of struct array CH: SDST */
/*
 * PERIOD_MCLK (RO)
 *
 * maxim of mclk spacing in cycles, using edges of mclk signal.  In manchester coding mode, it is just the period of MCLK. In other modes, it is almost the half period.
 */
#define SDM_CH_SDST_PERIOD_MCLK_MASK (0x7F800000UL)
#define SDM_CH_SDST_PERIOD_MCLK_SHIFT (23U)
#define SDM_CH_SDST_PERIOD_MCLK_GET(x) (((uint32_t)(x) & SDM_CH_SDST_PERIOD_MCLK_MASK) >> SDM_CH_SDST_PERIOD_MCLK_SHIFT)

/*
 * SDATA_D0_T1 (RO)
 *
 * 1: next readout is timestamp
 * 0: next readout is data
 */
#define SDM_CH_SDST_SDATA_D0_T1_MASK (0x2000U)
#define SDM_CH_SDST_SDATA_D0_T1_SHIFT (13U)
#define SDM_CH_SDST_SDATA_D0_T1_GET(x) (((uint32_t)(x) & SDM_CH_SDST_SDATA_D0_T1_MASK) >> SDM_CH_SDST_SDATA_D0_T1_SHIFT)

/*
 * SDFIFO_D0_T1 (RO)
 *
 * 1: next readout is timestamp
 * 0: next readout is data
 */
#define SDM_CH_SDST_SDFIFO_D0_T1_MASK (0x1000U)
#define SDM_CH_SDST_SDFIFO_D0_T1_SHIFT (12U)
#define SDM_CH_SDST_SDFIFO_D0_T1_GET(x) (((uint32_t)(x) & SDM_CH_SDST_SDFIFO_D0_T1_MASK) >> SDM_CH_SDST_SDFIFO_D0_T1_SHIFT)

/*
 * FIFO_DR (W1C)
 *
 * FIFO data ready
 */
#define SDM_CH_SDST_FIFO_DR_MASK (0x200U)
#define SDM_CH_SDST_FIFO_DR_SHIFT (9U)
#define SDM_CH_SDST_FIFO_DR_SET(x) (((uint32_t)(x) << SDM_CH_SDST_FIFO_DR_SHIFT) & SDM_CH_SDST_FIFO_DR_MASK)
#define SDM_CH_SDST_FIFO_DR_GET(x) (((uint32_t)(x) & SDM_CH_SDST_FIFO_DR_MASK) >> SDM_CH_SDST_FIFO_DR_SHIFT)

/*
 * AF (W1C)
 *
 * Achnowledge flag
 */
#define SDM_CH_SDST_AF_MASK (0x100U)
#define SDM_CH_SDST_AF_SHIFT (8U)
#define SDM_CH_SDST_AF_SET(x) (((uint32_t)(x) << SDM_CH_SDST_AF_SHIFT) & SDM_CH_SDST_AF_MASK)
#define SDM_CH_SDST_AF_GET(x) (((uint32_t)(x) & SDM_CH_SDST_AF_MASK) >> SDM_CH_SDST_AF_SHIFT)

/*
 * DOV_ERR (W1C)
 *
 * Data FIFO Overflow Error. Error flag.
 */
#define SDM_CH_SDST_DOV_ERR_MASK (0x80U)
#define SDM_CH_SDST_DOV_ERR_SHIFT (7U)
#define SDM_CH_SDST_DOV_ERR_SET(x) (((uint32_t)(x) << SDM_CH_SDST_DOV_ERR_SHIFT) & SDM_CH_SDST_DOV_ERR_MASK)
#define SDM_CH_SDST_DOV_ERR_GET(x) (((uint32_t)(x) & SDM_CH_SDST_DOV_ERR_MASK) >> SDM_CH_SDST_DOV_ERR_SHIFT)

/*
 * DSAT_ERR (W1C)
 *
 * CIC out Data saturation err. Error flag.
 */
#define SDM_CH_SDST_DSAT_ERR_MASK (0x40U)
#define SDM_CH_SDST_DSAT_ERR_SHIFT (6U)
#define SDM_CH_SDST_DSAT_ERR_SET(x) (((uint32_t)(x) << SDM_CH_SDST_DSAT_ERR_SHIFT) & SDM_CH_SDST_DSAT_ERR_MASK)
#define SDM_CH_SDST_DSAT_ERR_GET(x) (((uint32_t)(x) & SDM_CH_SDST_DSAT_ERR_MASK) >> SDM_CH_SDST_DSAT_ERR_SHIFT)

/*
 * WTSYNFLG (RO)
 *
 * Wait-for-sync event found
 */
#define SDM_CH_SDST_WTSYNFLG_MASK (0x20U)
#define SDM_CH_SDST_WTSYNFLG_SHIFT (5U)
#define SDM_CH_SDST_WTSYNFLG_GET(x) (((uint32_t)(x) & SDM_CH_SDST_WTSYNFLG_MASK) >> SDM_CH_SDST_WTSYNFLG_SHIFT)

/*
 * FILL (RO)
 *
 * Data FIFO Fillings
 */
#define SDM_CH_SDST_FILL_MASK (0x1FU)
#define SDM_CH_SDST_FILL_SHIFT (0U)
#define SDM_CH_SDST_FILL_GET(x) (((uint32_t)(x) & SDM_CH_SDST_FILL_MASK) >> SDM_CH_SDST_FILL_SHIFT)

